% ЗАВДАННЯ 2.3-2.10
A=[1 2 3 4 5; 6 7 8 9 11];
B=[0 -1 -2 -3 -4; 5 6 7 8 9];
f=[A;B]% вертикальна конкатенація матриць А і В
f=[A,B] % горизонтальна конкатенація матриць А і В

C1=A+B % сума матриць матриць А і В
C1=A-B % різниця матриць А і В

%C=A*B - не множиться, бо число стовпців не дорівнює число рядків
C2=A.*B % поелементне множення матриць А і В

A' % транспонована матриця А
B' % транспонована матриця В

C=A*B' % множення матриць А і В при n=m

inv(C) % обернена матриця С

E=C*inv(C) % перевірка правильності отримання оберненої матриці (одинична матриця Е)

det(C) % визначник матриці С