%ЗАВДАННЯ №1%
x1=(2.625-(2/3*(2+5/14)))/((3+1/12+4.375)/(19+8/9))

%ЗАВДАННЯ №2%
help elfun
help datafun
help graph2d

%ЗАВДАННЯ №3, приклад №4%
r=1;
sprintf ('Радіус r=%4.2f м; Довжина окружності L=%4.3f м',r,2*pi*r)
fprintf ('Радіус r=%4.2f м; Довжина окружності L=%4.3f м',r,2*pi*r)

%ЗАВДАННЯ №4, приклад №4%
%Для правильного відображення в полі історії (workspace) заданих коеф-ів a і b додані цифрові показники 1 та 2%
a1=4.13*10^-1;
b1=1/261;
x21=(3*a1^2*sqrt(6.8*(a1-b1)))/(4*(a1+b1)^3)

a2=sin((5*pi)/8);
b2=-tan(12);
x22=(3*a2^2*sqrt(6.8*(a2-b2)))/(4*(a2+b2)^3)