% перший графік функції y1(x1)
x1 = [-1.0:0.1:0.0];
y1 = (cos(pi*x1.^2))./sqrt(1-(3*x1));
subplot(1,2,1) % виводить перший графік у перше підвікно
plot(x1,y1,'r') % будує графік функції
grid on % ввімкнення сітки координат
title('Функція у1(х1)') % заголовок першої функції
legend('y1(x1)') % умовні позначення першої ф-ії
xlabel('Вісь х') % позначення вісі х
ylabel('Вісь y') % позначення вісі у

% другий графік функції y2(x2)
x2 = [0.0:0.1:1.6];
y2 = (2.*exp(-x2))./((2*x2)+x2.^3);
subplot(1,2,2) % виводить другий графік у друге підвікно
plot(x2,y2,'g--') % будує графік функції
grid on % ввімкнення сітки координат
title('Функція у2(х2)') % заголовок другої функції
legend('y2(x2)') % умовні позначення другої ф-ії
xlabel('Вісь х') % позначення вісі х
ylabel('Вісь y') % позначення вісі у